Revit 2027 API
Rebar.ConstraintsCanBeEdited Method
For ShapeDriven Rebar: returns true, if the Rebar element's external constraints are available for editing using the RebarConstraintsManager class. It will return false if Rebar is in Group
For FreeForm rebar: constraints can be edited if there is a valid external server Guid assigned to that Rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ConstraintsCanBeEdited()
Public Function ConstraintsCanBeEdited As Boolean
public:
bool ConstraintsCanBeEdited()
member ConstraintsCanBeEdited : unit -> bool
Return Value
Boolean
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace